xml-comparison-tests/src/main/java/com/sneo/api/compare/request/xml/compare/request3.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema">
    <SOAP-ENV:Header>
        <ns:credentials xmlns:ns="http://wsg.avis.com/wsbang/authInAny">
            <ns:userID ns:encodingType="xsd:string">QAuser</ns:userID>
            <ns:password ns:encodingType="xsd:string">QApassword</ns:password>
        </ns:credentials>
        <ns:WSBang-Roadmap xmlns:ns="http://wsg.avis.com/wsbang"/>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns:Request xmlns:ns="http://wsg.avis.com/wsbang">
            <OTA_VehAvailRateRQ xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" EchoToken="JSP1234"
                                TimeStamp="2003-12-17T09:30:47-05:00" Target="Production" Version="1.0" SequenceNmbr="1"
                                MaxResponses="32" ReqRespVersion="${ReqRespVersion}"
                                xsi:schemaLocation="http://www.opentravel.org/OTA/2003/05 OTA_VehAvailRateRQ.xsd"
                                xmlns="http://www.opentravel.org/OTA/2003/05">
                <POS>
                    <Source>
                        <RequestorID Type="1" ID="${RequestorID}"/>
                    </Source>
                </POS>
                <VehAvailRQCore Status="Unavailable">
                    <VehRentalCore PickUpDateTime="${PickUpDateTime}"
                                   ReturnDateTime="${ReturnDateTime}">
                        <PickUpLocation LocationCode="${Automatic}"/>
                        <ReturnLocation LocationCode="${ReturnLocation}"/>
                    </VehRentalCore>
                    <VendorPrefs>
                        <VendorPref CompanyShortName="${CompanyShortName}"/>
                    </VendorPrefs>
                    <VehPrefs>
                        <VehPref TypePref="Preferred" ClassPref="Preferred" TransmissionType="Automatic"
                                 TransmissionPref="Preferred" AirConditionPref="Preferred">
                            <VehType VehicleCategory="1"/>
                            <VehClass Size="66"/>
                            <VehGroup GroupType="SIPPCAR" GroupValue="${GroupValue}"/>
                        </VehPref>
                    </VehPrefs>
                </VehAvailRQCore>
                <VehAvailRQInfo>
                    <Customer>
                        <Primary>
                            <CitizenCountryName Code="${CitizenCountryName}"/>
                            <!--                            <CustLoyalty MembershipID="${MembershipID}"/>-->
                        </Primary>
                    </Customer>

                </VehAvailRQInfo>
            </OTA_VehAvailRateRQ>
        </ns:Request>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>